# В магазинах имеются следующие товары. Магнит – молоко, соль, сахар. Пятерочка – мясо, молоко, сыр. Определить:
# 1. какие товары из Магнита, отсутствуют в Пятерочке.
# 2. какие товары из Пятерочки, отсутствуют в Магните.
# 3. полный перечень всех товаров.
# 4. равны ли перечни товаров.

magnit = {"молоко", "соль", "сахар"}
pyaterochka = {"мясо", "молоко", "сыр"}

#1.
print('Товары из Магнита, отсутствующие в Пятерочке: ', magnit-pyaterochka)

#2.
print('Товары из Пятерочки, отсутствующие в Магните: ', pyaterochka-magnit)

#3.
print('Полный перечень всех товаров: ', magnit|pyaterochka)

#4.
print('Перечень товаров равны: ', magnit==pyaterochka)
